[GraphicalObject]
Name=IntegT
WndStyle=TOOLBAR
PosStyle=FIXED
X=0
Y=0
Width=800
Height=32
FrameThickness=0
RC-DLL=HPCor008.DLL

[ToolDescriptor]
1 = NoSel,         RADIOBUTTON,hpgbut02.dll
2 = DrawBaseline,  RADIOBUTTON,hpgbut02.dll
3 = NegatievePeaks,RADIOBUTTON,hpgbut02.dll
4 = TangentSkim,   RADIOBUTTON,hpgbut02.dll
5 = SplitPeaks,    RADIOBUTTON,hpgbut02.dll
6 = DeletePeaks,   RADIOBUTTON,hpgbut02.dll

[RadioButton NoSel]
ImageList=RBMP.ArrowSelect|RBMP.ArrowSelect_Down|RBMP.ArrowSelect||
Group= 1
x=0
y=0
width=32
height=32
Command=INT_SetIntegMenuSelection NoSel,1
Help=選択モード
FrameThickness=2

[RadioButton DrawBaseline]
ImageList=RBMP.ManualIntegrate|RBMP.ManualIntegrate_Down|RBMP.ManualIntegrate_Disable||
Group= 1
x=32
y=0
width=32
height=32
Command=INT_SetIntegMenuSelection DrawBaseline,1
Help=マニュアル積分: ピーク ベースラインを設定し、積分します
FrameThickness=2

[RadioButton NegatievePeaks]
ImageList=RBMP.MANUALBASELINENEGPEAK|RBMP.MANUALBASELINENEGPEAK_Down|RBMP.MANUALBASELINENEGPEAK_Disable||
Group= 1
x=64
y=0
width=32
height=32
Command=INT_SetIntegMenuSelection NegatievePeaks,1
Help=マニュアル積分: ネガティブ ピークのベースラインを設定し積分します
FrameThickness=2

[RadioButton TangentSkim]
ImageList=RBMP.ManualTangentSkim|RBMP.ManualTangentSkim_Down|RBMP.ManualTangentSkim_Disable||
Group= 1
x=96
y=0
width=32
height=32
Command=INT_SetIntegMenuSelection TangentSkim,1
Help=マニュアル積分: タンジェント スキムで積分します
FrameThickness=2

[RadioButton SplitPeaks]
ImageList=RBMP.MANUALSPLITPEAK|RBMP.MANUALSPLITPEAK_Down|RBMP.MANUALSPLITPEAK_Disable||
Group= 1
x=128
y=0
width=32
height=32
Command=INT_SetIntegMenuSelection SplitPeaks,1
Help=マニュアル積分: マニュアルでピークを分割し、積分します
FrameThickness=2

[RadioButton DeletePeaks]
ImageList=RBMP.ManualDeletePeaks|RBMP.ManualDeletePeaks_Down|RBMP.ManualDeletePeaks_Disable||
Group= 1
x=160
y=0
width=32
height=32
Command=INT_SetIntegMenuSelection DeletePeaks,1
Help=マニュアル積分: 積分結果から積分ピークを削除します
FrameThickness=2

